tap "homebrew/cask"
tap "heroku/brew"

brew "chezmoi"
brew "mas"
brew "neovim"
brew "tmux"
brew "tmuxinator"
brew "brew-cask-completion"
brew "ripgrep"
brew "reattach-to-user-namespace"
brew "yarn"

{{- if eq .chezmoi.hostname "NY1C02D63PCMD6R" }}
brew "nvm"
{{- end }}

{{- if eq .chezmoi.hostname "Jareds-MacBook-Pro" }}
brew "heroku"
brew "coreutils"
brew "curl"
brew "git"

cask "iterm2"
cask "backblaze"
cask "dropbox"
cask "zoom"
cask "rectangle"
cask "ngrok"
cask "discord"
cask "notion"
cask "sunsama"
cask "google-chrome"
cask "google-backup-and-sync"
# cask "rescuetime"

mas "Apple Developer", id: 640199958
mas "1Password", id: 1333542190
mas "Fantastical", id: 975937182
mas "Kindle", id: 405399194
mas "Keynote", id: 409183694
mas "Day One", id: 1055511498
mas "Bear", id: 1091189122
mas "Slack", id: 803453959
mas "Todoist", id: 585829637
mas "WhatsApp", id: 1147396723
mas "GoodNotes 5", id: 1444383602
mas "Pocket", id: 568494494
mas "Xcode", id: 497799835
{{- end }}
